Repository: S-LABc/DVR-Mini-Editor-Keyboard
Catalog: CSharp Software/Programmer/Languages/*.resx
Languages: russian

# fd_binary_filter
source: Binary file (*.bin)|*.bin
russian: Бинарный файл (*.bin)|*.bin

# fd_layout_filter
source: Layout file (*.mek)|*.mek
russian: Файл раскладки (*.mek)|*.mek

# form_main_text
source: Mini Editor Keyboard Configurator
russian: Конфигуратор Mini Editor Keyboard

# key_colors_list_name
source: key_colors_en
russian: key_colors_ru

# lable_color_text
source: Color:
russian: Цвет:

# lable_description_text
source: Description:
russian: Описание:

# lable_keys_text
source: Shortcut:
russian: Комбинация:

# lable_key_1
source: Key 1
russian: Клавиша 1

# lable_key_10
source: Key 10
russian: Клавиша 10

# lable_key_11
source: Key 11
russian: Клавиша 11

# lable_key_12
source: Key 12
russian: Клавиша 12

# lable_key_13
source: Key 13
russian: Клавиша 13

# lable_key_14
source: Key 14
russian: Клавиша 14

# lable_key_15
source: Key 15
russian: Клавиша 15

# lable_key_16
source: Key 16
russian: Клавиша 16

# lable_key_17
source: Key 17
russian: Клавиша 17

# lable_key_18
source: Key 18
russian: Клавиша 18

# lable_key_19
source: Key 19
russian: Клавиша 19

# lable_key_2
source: Key 2
russian: Клавиша 2

# lable_key_20
source: Key 20
russian: Клавиша 20

# lable_key_21
source: Key 21
russian: Клавиша 21

# lable_key_22
source: Key 22
russian: Клавиша 22

# lable_key_23
source: Key 23
russian: Клавиша 23

# lable_key_24
source: Key 24
russian: Клавиша 24

# lable_key_25
source: Key 25
russian: Клавиша 25

# lable_key_3
source: Key 3
russian: Клавиша 3

# lable_key_4
source: Key 4
russian: Клавиша 4

# lable_key_5
source: Key 5
russian: Клавиша 5

# lable_key_6
source: Key 6
russian: Клавиша 6

# lable_key_7
source: Key 7
russian: Клавиша 7

# lable_key_8
source: Key 8
russian: Клавиша 8

# lable_key_9
source: Key 9
russian: Клавиша 9

# lable_note_text
source: Note:
russian: Примечание:

# menu_check
source: Check
russian: Проверить

# menu_check_dfu
source: Communication DFU
russian: Связь DFU

# menu_check_swd
source: Communication SWD
russian: Связь SWD

# menu_driver
source: Driver
russian: Драйвер

# menu_driver_dfu
source: Install DFU
russian: Установить DFU

# menu_driver_st_link
source: Install SWD
russian: Установить SWD

# menu_export
source: Export
russian: Экспортировать

# menu_export_all_flash
source: All flash
russian: Всю память

# menu_export_bootloader
source: Bootloader
russian: Загрузчик

# menu_export_firmware
source: Firmware
russian: Прошивку

# menu_export_tools
source: Tools
russian: Инструменты

# menu_import
source: Import
russian: Импортировать

# menu_import_all_flash
source: All flash
russian: Всю память

# menu_import_bootloader
source: Bootloader
russian: Загрузчик

# menu_import_firmware
source: Firmware
russian: Прошивку

# menu_import_tools
source: Tools
russian: Инструменты

# menu_language
source: Language
russian: Язык

# menu_layout
source: Layout
russian: Раскладка

# menu_layout_open
source: Open
russian: Открыть

# menu_layout_restore
source: Restore
russian: Восстановить

# menu_layout_save
source: Save
russian: Сохранить

# menu_read
source: Read
russian: Считать

# menu_read_all_flash
source: All flash (SWD)
russian: Всю память (SWD)

# menu_read_bootloader
source: Bootloader (SWD)
russian: Загрузчик (SWD)

# menu_read_firmware
source: Firmware (DFU)
russian: Прошивку (DFU)

# menu_read_tools
source: Tools (DFU)
russian: Инструменты (DFU)

# menu_write
source: Write
russian: Записать

# menu_write_all_flash
source: All flash (SWD)
russian: Всю память (SWD)

# menu_write_bootloader
source: Bootloader (SWD)
russian: Загрузчик (SWD)

# menu_write_firmware
source: Firmware (DFU)
russian: Прошивку (DFU)

# menu_write_tools
source: Tools (DFU)
russian: Инструменты (DFU)

# message_caption_error
source: Error
russian: Ошибка

# message_caption_information
source: Notice
russian: Уведомление

# message_caption_warning
source: Warning
russian: Предупреждение

# message_change_language
source: Language changed. The program will restart
russian: Язык изменен. Программа перезагрузится

# message_dfuutil_device_found
source: The keyboard is detected in DFU mode!
russian: Клавиатура в режиме DFU обнаружена!

# message_dfuutil_device_not_found
source: No keyboard detected in DFU mode!
russian: Клавиатура в режиме DFU не обнаружена!

# message_dfuutil_read_firmware_done
source: Firmware reading completed!
russian: Считывание прошивки успешно завершено!

# message_dfuutil_read_tools_done
source: Tools reading completed!
russian: Считывание инструментов успешно завершено!

# message_dfuutil_write_firmware_done
source: Firmware writing completed!
russian: Запись прошивки успешно завершена!

# message_dfuutil_write_tools_done
source: Tools writing completed!
russian: Запись инструментов успешно завершена!

# message_dfu_error
source: Failed to install keyboard driver
russian: Не удалось установить драйвер клавиатуры

# message_dfu_success
source: Keyboard driver installed successfully
russian: Драйвер клавиатуры успешно установлен

# message_export_all_flash_success
source: All flash file exported successfully!
russian: Файл всей памяти успешно экспортирован!

# message_export_bootloader_success
source: Bootloader file exported successfully!
russian: Файл загрузчика успешно экспортирован!

# message_export_error
source: Export failed!
russian: Не удалось выполнить экспорт!

# message_export_firmware_success
source: Firmware file exported successfully!
russian: Файл прошивки успешно экспортирован!

# message_export_tools_success
source: Tools file exported successfully!
russian: Файл инструментов успешно экспортирован!

# message_import_all_flash_success
source: All flash file imported successfully!
russian: Файл всей памяти успешно импортирован!

# message_import_bootloader_success
source: Bootloader file imported successfully!
russian: Файл загрузчика успешно импортирован!

# message_import_error
source: Import failed!
russian: Не удалось выполнить импорт!

# message_import_firmware_success
source: Firmware file imported successfully!
russian: Файл прошивки успешно импортирован!

# message_import_tools_success
source: Tools file imported successfully!
russian: Файл инструментов успешно импортирован!

# message_layout_error
source: Failed to open the layout file!
russian: Не удалось открыть файл раскладки!

# message_stlink_device_found
source: The keyboard is detected SWD mode!
russian: Клавиатура в режиме SWD обнаружена!

# message_stlink_device_not_found
source: No keyboard detected in SWD mode!
russian: Клавиатура в режиме SWD не обнаружена!

# message_stlink_dump_all_flash_success
source: All flash has been read successfully!
russian: Вся память успешно считана!

# message_stlink_dump_bootloader_success
source: Bootloader read successfully!
russian: Загрузчик успешно считан!

# message_stlink_error
source: Unknown ST-Link error
russian: Неизвестная ошибка ST-Link

# message_stlink_st_link_not_found
source: ST-Link programmer not found!
russian: Программатор ST-Link не обнаружен!

# message_stlink_write_all_flash_done
source: All flash has been successfully written!
russian: Вся память успешно записана!

# message_stlink_write_bootloader_done
source: Bootloader was written successfully!
russian: Загрузчик успешно записан!

# message_swd_error
source: Failed to install ST-Link programmer driver
russian: Не удалось установить драйвер программатора ST-Link

# message_swd_success
source: ST-Link programmer driver successfully installed
russian: Драйвер программатора ST-Link успешно установлен

# ofd_import
source: Import file
russian: Импортировать файл

# ofd_open
source: Open file
russian: Открыть файл

# ofd_save
source: Save file
russian: Сохранить файл

# sfd_export
source: Export file
russian: Экспортировать файл

# tools_list_name
source: key_tools_en
russian: key_tools_ru
